SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_rcc.c
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
*\*\file n32g430_rcc.c
*\*\author Nations
*\*\version v1.0.1
*\*\copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved. 
**/
#include "n32g430_rcc.h"


/** RCC Private Defines **/
static const uint8_t APBAHBPresTable[16]     = {0, 0, 0, 0, 1, 2, 3, 4, 1, 2, 3, 4, 6, 7, 8, 9};
static const uint8_t ADCHCLKPresTable[16]    = {1, 2, 4, 6, 8, 10, 12, 16, 32, 32, 32, 32, 32, 32, 32, 32};
static const uint16_t ADCPLLCLKPresTable[16] = {1, 2, 4, 6, 8, 10, 12, 16, 32, 64, 128, 256, 256, 256, 256, 256};


/** RCC Driving Functions Declaration **/ 

/**
*\*\name    RCC_Reset.
*\*\fun     Reset the RCC registers.
*\*\param   none 
*\*\return  none
**/
void RCC_Reset(void)
{
    /* Set HSIEN bit */
    RCC->CTRL |= RCC_CTRL_HSIEN;            

    /* Reset SCLKSW, AHBPRES, APB1PRES, APB2PRES and MCO bits */   
    RCC->CFG &= ~(RCC_CFG_SCLKSW|RCC_CFG_AHBPRES|RCC_CFG_APB1PRES|RCC_CFG_APB2PRES|RCC_CFG_MCO);

    /* Reset HSEEN, CLKSSEN and PLLEN bits */
    RCC->CTRL &= ~(RCC_CTRL_HSEEN|RCC_CTRL_CLKSSEN|RCC_CTRL_PLLEN);

    /* Reset HSEBP bit */
    RCC->CTRL &= ~RCC_CTRL_HSEBP;

    /* Reset PLLSRC, PLLHSEPRES, PLLMULFCT bits */
    RCC->CFG &= ~(RCC_CFG_PLLSRC|RCC_CFG_PLLHSEPRES|RCC_CFG_PLLMULFCT);

    /* Reset CFG2 register */
    RCC->CFG2 = RCC_CFG2_ADC1MPRES_DIV8;

    /* Reset PLLHSIPRE register */
    RCC->PLLHSIPRE |= RCC_PLLHSIPRE_PLLHSIPRE;

    /* Disable all interrupts and clear pending bits  */
    RCC->CLKINT = (RCC_CLKINT_LSIRDICLR|RCC_CLKINT_LSERDICLR|RCC_CLKINT_HSIRDICLR
                  |RCC_CLKINT_HSERDICLR|RCC_CLKINT_PLLRDICLR
                  |RCC_CLKINT_CLKSSICLR|RCC_CLKINT_LSESSICLR);
}


/**
*\*\name    RCC_HSE_Config.
*\*\fun     Configures the External High Speed oscillator (HSE).
*\*\param   RCC_HSE :
*\*\          - RCC_HSE_DISABLE    HSE oscillator OFF 
*\*\          - RCC_HSE_ENABLE     HSE oscillator ON
*\*\          - RCC_HSE_BYPASS     HSE oscillator bypassed with external clock
*\*\return  none:
*\*\note    HSE can not be stopped if it is used directly or through the PLL as system clock
**/
void RCC_HSE_Config(uint32_t RCC_HSE)
{
    /* Reset HSEEN and HSEBP bits before configuring the HSE */
    /* Reset HSEEN bit */
    RCC->CTRL &= (~RCC_HSE_ENABLE);
    /* Reset HSEBP bit */
    RCC->CTRL &= (~RCC_HSE_BYPASS);
    /* Configure HSE (RC_HSE_DISABLE is already covered by the code section above) */
    if(RCC_HSE == RCC_HSE_ENABLE)
    {
        /* Set HSEEN bit */
        RCC->CTRL |= RCC_HSE_ENABLE;
    }   
    else if (RCC_HSE == RCC_HSE_BYPASS)
    {
        /* Set HSEBP and HSEEN bits */
        RCC->CTRL |= RCC_HSE_BYPASS | RCC_HSE_ENABLE;
    }
    else
    {
        /* No process */
    }

}
 
/**
*\*\name    RCC_HSE_Stable_Wait.
*\*\fun     Waits for HSE start-up.
*\*\param   none
*\*\return  ErrorStatus:
 *\*\         - SUCCESS    HSE oscillator is stable and ready to use
 *\*\         - ERROR      HSE oscillator not yet ready
**/
ErrorStatus RCC_HSE_Stable_Wait(void)
{
    __IO uint32_t counter_value = 0;
    uint32_t timeout_value = 0;  
    FlagStatus status_value     = RESET;
	RCC_ClocksType sysclk_value;

	RCC_Clocks_Frequencies_Value_Get(&sysclk_value);
	timeout_value = (HSE_STARTUP_TIMEOUT/((uint32_t)SYSCLK_FREQ_128M/sysclk_value.SysclkFreq));
	
    /* Wait till HSE is ready and if Time out is reached exit */
    do
    {
        status_value = RCC_Flag_Status_Get(RCC_FLAG_HSERD);
        counter_value++;
    } while ((counter_value != timeout_value) && (status_value == RESET));
    
    if (RCC_Flag_Status_Get(RCC_FLAG_HSERD) != RESET)
    {
        return SUCCESS;
    }
    else
    {
        return ERROR;
    }
}
 
/**
*\*\name    RCC_Clock_Security_System_Enable.
*\*\fun     Enables the HSE Clock Security System.
*\*\param   none  
*\*\return  none. 
**/
void RCC_Clock_Security_System_Enable(void)
{
    *(__IO uint32_t*)RCC_CLKSSEN_BITBAND = (uint32_t)ENABLE;
}

/**
*\*\name    RCC_Clock_Security_System_Disable.
*\*\fun     Disables the HSE Clock Security System.
*\*\param   none  
*\*\return  none. 
**/
void RCC_Clock_Security_System_Disable(void)
{
    *(__IO uint32_t*)RCC_CLKSSEN_BITBAND = (uint32_t)DISABLE;
}

/**
*\*\name    RCC_HSI_Calibration_Value_Set.
*\*\fun     Adjusts the Internal High Speed oscillator (HSI) calibration value.
*\*\param   calibration_value(the calibration trimming value):
*\*\        This parameter must be a number between 0 and 0x1F
*\*\return  none
**/ 
void RCC_HSI_Calibration_Value_Set(uint8_t calibration_value) 
{
    uint32_t temp_value = 0;

    temp_value = RCC->CTRL;
    /* Clear HSITRIM[4:0] bits */
    temp_value &= RCC_HSITRIM_MASK;
    /* Set the HSITRIM[4:0] bits according to HSICalibrationValue value */
    temp_value |= (uint32_t)calibration_value << RCC_CTRL_HSITRIM_OFFSET; 
    /* Store the new value */
    RCC->CTRL = temp_value;
}

/**
*\*\name    RCC_HSI_Enable.
*\*\fun     Enables the Internal High Speed oscillator (HSI).
*\*\param   none
*\*\return  none
**/ 
void RCC_HSI_Enable(void)
{
    *(__IO uint32_t*)RCC_HSIEN_BITBAND = (uint32_t)ENABLE;
}
 
/**
*\*\name    RCC_HSI_Disable.
*\*\fun     Disables the Internal High Speed oscillator (HSI).
*\*\param   none
*\*\return  none
**/ 
void RCC_HSI_Disable(void)
{
    *(__IO uint32_t*)RCC_HSIEN_BITBAND = (uint32_t)DISABLE;
}

/**
*\*\name    RCC_HSI_Stable_Wait.
*\*\fun     Waits for HSI start-up.
*\*\param   none
*\*\return  ErrorStatus:
 *\*\         - SUCCESS    HSI oscillator is stable and ready to use
 *\*\         - ERROR      HSI oscillator not yet ready
**/
ErrorStatus RCC_HSI_Stable_Wait(void)
{
    __IO uint32_t counter_value = 0;
    uint32_t timeout_value = 0;  
    FlagStatus status_value     = RESET;
	RCC_ClocksType sysclk_value;

	RCC_Clocks_Frequencies_Value_Get(&sysclk_value);
	timeout_value = (HSE_STARTUP_TIMEOUT/((uint32_t)SYSCLK_FREQ_128M/sysclk_value.SysclkFreq));

    /* Wait till HSI is ready and if Time out is reached exit */
    do
    {
        status_value = RCC_Flag_Status_Get(RCC_FLAG_HSIRD);
        counter_value++;
    } while ((counter_value != timeout_value) && (status_value == RESET));
    
