SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_rcc.c
    /* Store the new value */
    RCC->CFG2 = temp_value;
}

/**
*\*\name    RCC_ADC_1M_Clock_Config.
*\*\fun     Configures the ADCx 1M clock (ADC1MCLK).
*\*\param   ADC1M_clksrc(ADC1M clock source):
*\*\         - RCC_ADC1MCLK_SRC_HSI
*\*\         - RCC_ADC1MCLK_SRC_HSE
*\*\param   ADC1M_prescaler(ADC1M clock prescaler):
*\*\         - RCC_ADC1MCLK_DIV1 
*\*\         - RCC_ADC1MCLK_DIV2 
*\*\         - RCC_ADC1MCLK_DIV3 
*\*\         - RCC_ADC1MCLK_DIV4 
*\*\         - RCC_ADC1MCLK_DIV5 
*\*\         - RCC_ADC1MCLK_DIV6 
*\*\         - RCC_ADC1MCLK_DIV7 
*\*\         - RCC_ADC1MCLK_DIV8 
*\*\         - RCC_ADC1MCLK_DIV9 
*\*\         - RCC_ADC1MCLK_DIV10
*\*\         - RCC_ADC1MCLK_DIV11
*\*\         - RCC_ADC1MCLK_DIV12
*\*\         - RCC_ADC1MCLK_DIV13
*\*\         - RCC_ADC1MCLK_DIV14
*\*\         - RCC_ADC1MCLK_DIV15
*\*\         - RCC_ADC1MCLK_DIV16
*\*\         - RCC_ADC1MCLK_DIV17
*\*\         - RCC_ADC1MCLK_DIV18
*\*\         - RCC_ADC1MCLK_DIV19
*\*\         - RCC_ADC1MCLK_DIV20
*\*\         - RCC_ADC1MCLK_DIV21
*\*\         - RCC_ADC1MCLK_DIV22
*\*\         - RCC_ADC1MCLK_DIV23
*\*\         - RCC_ADC1MCLK_DIV24
*\*\         - RCC_ADC1MCLK_DIV25
*\*\         - RCC_ADC1MCLK_DIV26
*\*\         - RCC_ADC1MCLK_DIV27
*\*\         - RCC_ADC1MCLK_DIV28
*\*\         - RCC_ADC1MCLK_DIV29
*\*\         - RCC_ADC1MCLK_DIV30
*\*\         - RCC_ADC1MCLK_DIV31
*\*\         - RCC_ADC1MCLK_DIV32
*\*\return  none
**/
void RCC_ADC_1M_Clock_Config(uint32_t ADC1M_clksrc, uint32_t ADC1M_prescaler)
{
    uint32_t temp_value = 0;

    temp_value = RCC->CFG2;
    /* Clear ADC1MSEL and ADC1MPRE[4:0] bits */
    temp_value &= RCC_ADC1MCLK_SRC_MASK;
    temp_value &= RCC_ADC1MCLK_DIV_MASK;
    /* Set ADC1MSEL bits according to ADC1M_clksrc value */
    temp_value |= ADC1M_clksrc;
    /* Set ADC1MPRE[4:0] bits according to ADC1M_prescaler value */
    temp_value |= ADC1M_prescaler;

    /* Store the new value */
    RCC->CFG2 = temp_value;
}

/**
*\*\name    RCC_ADC_PLL_Clock_Prescaler_Enable.
*\*\fun     Configures the ADCPLLCLK prescaler, and enable ADCPLLCLK.
*\*\param   ADC_PLLCLK_prescaler(ADCPLLCLK prescaler):
*\*\         - RCC_ADCPLLCLK_DIV1       ADCPLLCLKPRES[4:0] = 10000, Pll Clock Divided By 1
*\*\         - RCC_ADCPLLCLK_DIV2       ADCPLLCLKPRES[4:0] = 10001, Pll Clock Divided By 2
*\*\         - RCC_ADCPLLCLK_DIV4       ADCPLLCLKPRES[4:0] = 10010, Pll Clock Divided By 4
*\*\         - RCC_ADCPLLCLK_DIV6       ADCPLLCLKPRES[4:0] = 10011, Pll Clock Divided By 6
*\*\         - RCC_ADCPLLCLK_DIV8       ADCPLLCLKPRES[4:0] = 10100, Pll Clock Divided By 8
*\*\         - RCC_ADCPLLCLK_DIV10      ADCPLLCLKPRES[4:0] = 10101, Pll Clock Divided By 10
*\*\         - RCC_ADCPLLCLK_DIV12      ADCPLLCLKPRES[4:0] = 10110, Pll Clock Divided By 12
*\*\         - RCC_ADCPLLCLK_DIV16      ADCPLLCLKPRES[4:0] = 10111, Pll Clock Divided By 16
*\*\         - RCC_ADCPLLCLK_DIV32      ADCPLLCLKPRES[4:0] = 11000, Pll Clock Divided By 32
*\*\         - RCC_ADCPLLCLK_DIV64      ADCPLLCLKPRES[4:0] = 11001, Pll Clock Divided By 64
*\*\         - RCC_ADCPLLCLK_DIV128     ADCPLLCLKPRES[4:0] = 11010, Pll Clock Divided By 128
*\*\         - RCC_ADCPLLCLK_DIV256     ADCPLLCLKPRES[4:0] = 11011, Pll Clock Divided By 256
*\*\         - RCC_ADCPLLCLK_DIV_OTHERS ADCPLLCLKPRES[4:0] = others, Pll Clock Divided By 256
*\*\return  none
**/
void RCC_ADC_PLL_Clock_Prescaler_Enable(uint32_t ADC_PLLCLK_prescaler)
{
    uint32_t temp_value = 0;

    temp_value = RCC->CFG2;
    /* Clear ADCPLLPRES[4:0] bits */
    temp_value &= RCC_ADCPLLCLK_MASK;

    temp_value |= ADC_PLLCLK_prescaler;

    /* Store the new value */
    RCC->CFG2 = temp_value;
}

/**
*\*\name    RCC_ADC_PLL_Clock_Disable.
*\*\fun     Disable ADCPLLCLK (ADCPLLCLKPRES[4:0] = 0xxxx, ADC Pll Clock Disable).
*\*\param   none
*\*\return  none
**/
void RCC_ADC_PLL_Clock_Disable(void)
{
    /* Clear ADCPLLPRES[4:0] bit4 */
    RCC->CFG2 &= RCC_ADCPLLCLK_DISABLE;
}

/**
*\*\name    RCC_ADC_Hclk_Config.
*\*\fun     Configures the ADCHCLK prescaler.
*\*\param   ADC_hclk_prescaler(ADCHCLK prescaler):
*\*\         - RCC_ADCHCLK_DIV1        ADCHCLKPRE[3:0] = 0000, HCLK Clock Divided By 1
*\*\         - RCC_ADCHCLK_DIV2        ADCHCLKPRE[3:0] = 0001, HCLK Clock Divided By 2
*\*\         - RCC_ADCHCLK_DIV4        ADCHCLKPRE[3:0] = 0010, HCLK Clock Divided By 4
*\*\         - RCC_ADCHCLK_DIV6        ADCHCLKPRE[3:0] = 0011, HCLK Clock Divided By 6
*\*\         - RCC_ADCHCLK_DIV8        ADCHCLKPRE[3:0] = 0100, HCLK Clock Divided By 8
*\*\         - RCC_ADCHCLK_DIV10       ADCHCLKPRE[3:0] = 0101, HCLK Clock Divided By 10
*\*\         - RCC_ADCHCLK_DIV12       ADCHCLKPRE[3:0] = 0110, HCLK Clock Divided By 12
*\*\         - RCC_ADCHCLK_DIV16       ADCHCLKPRE[3:0] = 0111, HCLK Clock Divided By 16
*\*\         - RCC_ADCHCLK_DIV32       ADCHCLKPRE[3:0] = 1000, HCLK Clock Divided By 32
*\*\         - RCC_ADCHCLK_DIV_OTHERS  ADCHCLKPRE[3:0] = others, HCLK Clock Divided By 32
*\*\return  none
**/
void RCC_ADC_Hclk_Config(uint32_t ADC_hclk_prescaler)
{
    uint32_t temp_value = 0;

    temp_value = RCC->CFG2;
    /* Clear ADCHPRE[3:0] bits */
    temp_value &= RCC_ADCHCLK_DIV_MASK;
    /* Set ADCHPRE[3:0] bits according to ADC_hclk_prescaler value */
    temp_value |= ADC_hclk_prescaler;

    /* Store the new value */
    RCC->CFG2 = temp_value;
}

/**
*\*\name    RCC_ADC_Hclk_Enable.
*\*\fun     Enables the ADC AHB peripheral clock.
*\*\param   none
*\*\return  none
**/
void RCC_ADC_Hclk_Enable(void)
{
    /* Store the new value */
    RCC->AHB1CLKEN |= RCC_ADCHCLK_ENABLE;
}

/**
*\*\name    RCC_ADC_Hclk_Disable.
*\*\fun     Disables the ADC AHB peripheral clock.
*\*\param   none
*\*\return  none
**/
void RCC_ADC_Hclk_Disable(void)
{
    /* Store the new value */
    RCC->AHB1CLKEN &= (~RCC_ADCHCLK_ENABLE);
}

/**
*\*\name  RCC_LSE_Trim_Config.
*\*\fun  Configures the External Low Speed oscillator (LSE) Trim.
*\*\param   LSE_Trim(LSE Driver Trim Level):
*\*\         - 0x00~0x1FF    
*\*\return  none
**/
void RCC_LSE_Trim_Config(uint16_t LSE_Trim)
{
    uint32_t temp_value = 0;
	
    temp_value = *(__IO uint32_t*)LSE_TRIMR_ADDR;
    /*clear lse trim[8:0]*/
    temp_value &= (~(LSE_GM_MASK_VALUE));
	/*Check and set trim value */
    (LSE_Trim>LSE_GM_MAX_VALUE) ? (LSE_Trim = LSE_GM_MAX_VALUE):(LSE_Trim &= LSE_GM_MASK_VALUE);
    /*Set PWR_CR4 bit15 and bit[8:0] */
	temp_value |= (LSE_NIM_MASK_VALUE|LSE_Trim);
	/* Store the new value */
    *(__IO uint32_t*)LSE_TRIMR_ADDR = temp_value;
}

/**
*\*\name    RCC_LSE_Config.
*\*\fun     Configures the External Low Speed oscillator (LSE).
*\*\param   RCC_LSE(the new state of the LSE):
*\*\         - RCC_LSE_DISABLE    LSE oscillator OFF
*\*\         - RCC_LSE_ENABLE     LSE oscillator ON
*\*\         - RCC_LSE_BYPASS     LSE oscillator bypassed with external clock
*\*\param   LSE_Trim(LSE Driver Trim Level):
*\*\         - 0x00~0x1FF(default value:0x141)    
*\*\return  none
*\*\note  When you do not need to modify the TRIM value, LSE_Trim fill default value(0x141)  
**/
void RCC_LSE_Config(uint32_t RCC_LSE,uint16_t LSE_Trim)
{
    /* Enable PWR Clock */
    RCC_APB1_Peripheral_Clock_Enable(RCC_APB1_PERIPH_PWR);
	/* PWR DBKP set 1 */
    PWR->CTRL |=  PWR_CTRL_DBKP;
    
    /* Reset LSEEN LSEBP bits before configuring the LSE */
    *(__IO uint32_t*)RCC_BDCTRL_ADDR &= (~(RCC_LSE_ENABLE | RCC_LSE_BYPASS));
    /* Configure LSE (RCC_LSE_DISABLE is already covered by the code section above) */
    switch (RCC_LSE)
    {
		case RCC_LSE_ENABLE:
			/* Set LSEON bit */
			*(__IO uint32_t*)RCC_BDCTRL_ADDR |= RCC_LSE_ENABLE;
			RCC_LSE_Trim_Config(LSE_Trim);
			break;
		case RCC_LSE_BYPASS:
			/* Set LSEBYP and LSEON bits */
			*(__IO uint32_t*)RCC_BDCTRL_ADDR |= (RCC_LSE_BYPASS | RCC_LSE_ENABLE);
			break;
		default:
			break;
    }
}

/**
*\*\name    RCC_LSE_Clock_Security_System_Enable.
*\*\fun     Enables the LSE Clock Security System.
*\*\param   none
*\*\return  none
**/
void RCC_LSE_Clock_Security_System_Enable(void)
{
    *(__IO uint32_t*)RCC_LSECLKSSEN_BITBAND = (uint32_t)ENABLE;
}

/**
*\*\name    RCC_LSE_Clock_Security_System_Disable.
*\*\fun     Disables the LSE Clock Security System.
*\*\param   none
*\*\return  none
**/
void RCC_LSE_Clock_Security_System_Disable(void)
{
    *(__IO uint32_t*)RCC_LSECLKSSEN_BITBAND = (uint32_t)DISABLE;
}

/**
*\*\name    RCC_LSE_Clock_Security_System_Status_Get.
*\*\fun     Get LSE Clock Security System failure status.
*\*\param   none
*\*\return  FlagStatus ：SET or RESET
**/
FlagStatus RCC_LSE_Clock_Security_System_Status_Get(void)
{
    /* Check the status of LSE Clock Security System */
    if ((RCC->BDCTRL & RCC_LSE_LSECLKSSF) != (uint32_t)RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }

