SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_rcc.c
}

/**
*\*\name    RCC_LSE_Stable_Wait.
*\*\fun     Waits for LSE start-up.
*\*\param   none
*\*\return  ErrorStatus:
 *\*\         - SUCCESS    LSE oscillator is stable and ready to use
 *\*\         - ERROR      LSE oscillator not yet ready
**/
ErrorStatus RCC_LSE_Stable_Wait(void)
{
    __IO uint32_t counter_value = 0;
    uint32_t timeout_value = 0;   
    FlagStatus status_value     = RESET;
	RCC_ClocksType sysclk_value;

	RCC_Clocks_Frequencies_Value_Get(&sysclk_value);
	timeout_value = (HSE_STARTUP_TIMEOUT/((uint32_t)SYSCLK_FREQ_128M/sysclk_value.SysclkFreq));

    /* Wait till LSE is ready and if Time out is reached exit */
    do
    {
        status_value = RCC_Flag_Status_Get(RCC_FLAG_LSERD);
        counter_value++;
    } while ((counter_value != timeout_value) && (status_value == RESET));
    
    if (RCC_Flag_Status_Get(RCC_FLAG_LSERD) != RESET)
    {
        return SUCCESS;
    }
    else
    {
        return ERROR;
    }
}

/**
*\*\name    RCC_LSI_Enable.
*\*\fun     Enables the Internal Low Speed oscillator (LSI).
*\*\param   none
*\*\return  none
**/
void RCC_LSI_Enable(void)
{
    *(__IO uint32_t*)RCC_LSIEN_BITBAND = (uint32_t)ENABLE;
}

/**
*\*\name    RCC_LSI_Disable.
*\*\fun     Disables the Internal Low Speed oscillator (LSI).
*\*\param   none
*\*\return  none
*\*\note   LSI can not be disabled if the IWDG is running.
**/
void RCC_LSI_Disable(void)
{
    *(__IO uint32_t*)RCC_LSIEN_BITBAND = (uint32_t)DISABLE;
}

/**
*\*\name    RCC_LSI_Stable_Wait.
*\*\fun     Waits for LSI start-up.
*\*\param   none
*\*\return  ErrorStatus:
 *\*\         - SUCCESS    LSI oscillator is stable and ready to use
 *\*\         - ERROR      LSI oscillator not yet ready
**/
ErrorStatus RCC_LSI_Stable_Wait(void)
{
    __IO uint32_t counter_value = 0;
    uint32_t timeout_value = 0;   
    FlagStatus status_value     = RESET;
	RCC_ClocksType sysclk_value;

	RCC_Clocks_Frequencies_Value_Get(&sysclk_value);
	timeout_value = (HSE_STARTUP_TIMEOUT/((uint32_t)SYSCLK_FREQ_128M/sysclk_value.SysclkFreq));

    /* Wait till LSI is ready and if Time out is reached exit */
    do
    {
        status_value = RCC_Flag_Status_Get(RCC_FLAG_LSIRD);
        counter_value++;
    } while ((counter_value != timeout_value) && (status_value == RESET));
    
    if (RCC_Flag_Status_Get(RCC_FLAG_LSIRD) != RESET)
    {
        return SUCCESS;
    }
    else
    {
        return ERROR;
    }
}

/**
*\*\name    RCC_RTC_Clock_Config.
*\*\fun     Configures the RTC clock (RTCCLK).
*\*\param   rtcclk_source(the RTC clock source):
*\*\         - RCC_RTCCLK_SRC_NONE          No clock selected as RTC clock)
*\*\         - RCC_RTCCLK_SRC_LSE           LSE selected as RTC clock)
*\*\         - RCC_RTCCLK_SRC_LSI           LSI selected as RTC clock)
*\*\         - RCC_RTCCLK_SRC_HSE_DIV128    HSE clock divided by 128 selected as RTC clock
*\*\return  none
*\*\note    Once the RTC clock is selected it can't be changed unless the Backup domain is reset.
**/
void RCC_RTC_Clock_Config(uint32_t rtcclk_source)
{
    /* Clear the RTC clock source */
    RCC->BDCTRL &= RCC_RTCCLK_SRC_MASK;
    /* Select the RTC clock source */
    RCC->BDCTRL |= rtcclk_source;
}

/**
*\*\name    RCC_RTC_Clock_Enable.
*\*\fun     Enables the RTC clock.
*\*\param   none
*\*\return  none
*\*\note    This function must be used only after the RTC clock was selected 
*\*\        using the RCC_Config_Rtc_Clock function.
**/
void RCC_RTC_Clock_Enable(void)
{
    *(__IO uint32_t*)RCC_RTCEN_BITBAND = (uint32_t)ENABLE;
}

/**
*\*\name    RCC_RTC_Clock_Disable.
*\*\fun     Disables the RTC clock.
*\*\param   none
*\*\return  none
**/
void RCC_RTC_Clock_Disable(void)
{
    *(__IO uint32_t*)RCC_RTCEN_BITBAND = (uint32_t)DISABLE;
}

/**
*\*\name  RCC_LPTIM_Clock_Config.
*\*\fun   Configures the LPTIM clock (LPTIMCLK).
*\*\param clock_source  (specifies the LPTIM clock source).
*\*\     - RCC_LPTIMCLK_SRC_APB1  APB1 clock selected as LPTIM clock
*\*\     - RCC_LPTIMCLK_SRC_LSI   LSI selected as LPTIM clock
*\*\     - RCC_LPTIMCLK_SRC_HSI   HSI selected as LPTIM clock
*\*\     - RCC_LPTIMCLK_SRC_LSE   LSE selected as LPTIM clock
*\*\note When switching from comparator1/2 to other clock sources,
*\*\      it is suggested to disable comparators first.
**/
void RCC_LPTIM_Clock_Config(uint32_t clock_source)
{
    //PWR DBP set 1
    RCC_APB1_Peripheral_Clock_Enable(RCC_APB1_PERIPH_PWR);
    PWR->CTRL |=  PWR_CTRL_DBKP;
    /* Clear the LPTIM clock source */
    RCC->RDCTRL &= RCC_LPTIMCLK_SRC_MASK;

    /* Select the LPTIM clock source */
    RCC->RDCTRL |= clock_source;
}

/**
*\*\name    RCC_LPTIM_Reset.
*\*\fun     LPTIM reset.
*\*\param   none  
*\*\return  none. 
**/
void RCC_LPTIM_Reset(void)
{ 
    RCC->RDCTRL |= (RCC_LPTIMCLK_RESET);
    RCC->RDCTRL &= (~RCC_LPTIMCLK_RESET);
}

/**
*\*\name    RCC_LPTIM_Enable.
*\*\fun     Enables LPTIM.
*\*\param   none  
*\*\return  none. 
**/
void RCC_LPTIM_Enable(void)
{ 
    RCC->RDCTRL |= (RCC_LPTIMCLK_ENBLE);
}

/**
*\*\name    RCC_LPTIM_Disable.
*\*\fun     Disables LPTIM.
*\*\param   none  
*\*\return  none. 
**/
void RCC_LPTIM_Disable(void)
{ 
    RCC->RDCTRL &= (~RCC_LPTIMCLK_ENBLE);
}

/**
*\*\name    RCC_Clocks_Frequencies_Value_Get.
*\*\fun     Returns the frequencies of different on chip clocks.
*\*\param   RCC_clocks pointer to a RCC_ClocksType structure which will hold
*\*\        the clocks frequencies.
*\*\return  none
*\*\note    The result of this function could be not correct when using
*\*\        fractional value for HSE crystal.
**/
void RCC_Clocks_Frequencies_Value_Get(RCC_ClocksType* RCC_clocks)
{
    uint32_t temp_value = SYSCLK_SRC_HSI;
    uint32_t pllclk_value = 0, pllmull_value = 0,pllsource_value = 0, presc_value = 0;

    /* Get PLL clock source and multiplication factor */
    pllmull_value   = RCC->CFG & RCC_CFG_PLLMULFCT;
    pllsource_value = RCC->CFG & RCC_CFG_PLLSRC;

    /* Calculate the frequency division factor */
    if ((pllmull_value & RCC_CFG_PLLMULFCT_4) == 0)
    {
        /*  PLLMULFCT[4] = 0 */
        pllmull_value = (pllmull_value >> RCC_CFG_PLLMULFCT_OFFSET) + 2; 
    }
    else
    {
        // PLLMULFCT[4] = 1
        pllmull_value = ((pllmull_value >> RCC_CFG_PLLMULFCT_OFFSET) - 496) + 1; 
    }

    if (pllsource_value == 0) /* HSI as PLL input clock  */
    { 
         /* HSI selected as PLL clock entry */
        if ((RCC->PLLHSIPRE & RCC_PLLHSIPRE_PLLHSIPRE) != (uint32_t)RESET)
        { /* HSI oscillator clock divided by 2 */
            pllclk_value = (HSI_VALUE >> RCC_CLOCK_DIV2_OFFSET) * pllmull_value;
        }
        else
        {
            pllclk_value = HSI_VALUE * pllmull_value;
        }
    }
    else /* HSE as PLL input clock  */
    {
        /* HSE selected as PLL clock entry */
        if ((RCC->CFG & RCC_CFG_PLLHSEPRES) != (uint32_t)RESET)
        { /* HSE oscillator clock divided by 2 */
            pllclk_value = (HSE_VALUE >> RCC_CLOCK_DIV2_OFFSET) * pllmull_value;
        }
        else
        {
            pllclk_value = HSE_VALUE * pllmull_value;
        }
    }

    /* Get SYSCLK source -------------------------------------------------------*/
    temp_value = RCC->CFG & RCC_CFG_SCLKSTS;

