SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_rcc.c
    switch (temp_value)
    {
        case SYSCLK_SRC_HSI: 
            /* HSI used as system clock */
            RCC_clocks->SysclkFreq = HSI_VALUE;
            break;
        case SYSCLK_SRC_HSE: 
            /* HSE used as system clock */
            RCC_clocks->SysclkFreq = HSE_VALUE;
            break;
        case SYSCLK_SRC_PLL: 
            /* PLL used as system clock */
            RCC_clocks->SysclkFreq = pllclk_value;
            break;

        default:
            /* default HSI used as system clock */
            RCC_clocks->SysclkFreq = HSI_VALUE;
            break;
    }

    /* Compute HCLK, PCLK1, PCLK2 and ADCCLK clocks frequencies ----------------*/
    /* Get HCLK prescaler */
    temp_value   = (RCC->CFG & RCC_CFG_AHBPRES) >> RCC_CFG_AHBPRES_OFFSET; 
    presc_value = APBAHBPresTable[temp_value];
    /* HCLK clock frequency */
    RCC_clocks->HclkFreq = RCC_clocks->SysclkFreq >> presc_value;
    /* Get PCLK1 prescaler */
    temp_value   = (RCC->CFG & RCC_CFG_APB1PRES) >> RCC_CFG_APB1PRES_OFFSET; 
    presc_value = APBAHBPresTable[temp_value];
    /* PCLK1 clock frequency */
    RCC_clocks->Pclk1Freq = RCC_clocks->HclkFreq >> presc_value;
    /* Get PCLK2 prescaler */
    temp_value   = (RCC->CFG & RCC_CFG_APB2PRES) >> RCC_CFG_APB2PRES_OFFSET; 
    presc_value = APBAHBPresTable[temp_value];
    /* PCLK2 clock frequency */
    RCC_clocks->Pclk2Freq = RCC_clocks->HclkFreq >> presc_value;

    /* Get ADCHCLK prescaler */
    temp_value   = RCC->CFG2 & RCC_CFG2_ADCHPRES;
    presc_value = ADCHCLKPresTable[temp_value];
    /* ADCHCLK clock frequency */
    RCC_clocks->AdcHclkFreq = RCC_clocks->HclkFreq / presc_value;
    /* Get ADCPLLCLK prescaler */
    temp_value   = (RCC->CFG2 & RCC_CFG2_ADCPLLPRES) >> RCC_CFG2_ADCPLLPRES_OFFSET; 
    presc_value = ADCPLLCLKPresTable[(temp_value & 0x0F)]; // ignore BIT5
    /* ADCPLLCLK clock frequency */
    RCC_clocks->AdcPllClkFreq = pllclk_value / presc_value;
}

/**
*\*\name    RCC_AHB_Peripheral_Clock_Enable.
*\*\fun     Enables the AHB peripheral clock.
*\*\param   AHB_periph (AHB peripheral to gates its clock):
*\*\         - RCC_AHB_PERIPH_DMA    
*\*\         - RCC_AHB_PERIPH_SRAM   
*\*\         - RCC_AHB_PERIPH_FLITF  
*\*\         - RCC_AHB_PERIPH_CRC    
*\*\         - RCC_AHB_PERIPH_GPIOA   
*\*\         - RCC_AHB_PERIPH_GPIOB   
*\*\         - RCC_AHB_PERIPH_GPIOC   
*\*\         - RCC_AHB_PERIPH_GPIOD   
*\*\         - RCC_AHB_PERIPH_ADC     
*\*\return  none
**/
void RCC_AHB_Peripheral_Clock_Enable(uint32_t AHB_periph)
{
    RCC->AHBPCLKEN |= AHB_periph;
}

/**
*\*\name    RCC_AHB_Peripheral_Clock_Disable.
*\*\fun     Disables the AHB peripheral clock.
*\*\param   AHB_periph (AHB peripheral to gates its clock):
*\*\         - RCC_AHB_PERIPH_DMA    
*\*\         - RCC_AHB_PERIPH_SRAM   
*\*\         - RCC_AHB_PERIPH_FLITF  
*\*\         - RCC_AHB_PERIPH_CRC    
*\*\         - RCC_AHB_PERIPH_GPIOA   
*\*\         - RCC_AHB_PERIPH_GPIOB   
*\*\         - RCC_AHB_PERIPH_GPIOC   
*\*\         - RCC_AHB_PERIPH_GPIOD   
*\*\         - RCC_AHB_PERIPH_ADC     
*\*\return  none
*\*\note    SRAM and FLITF clock can be disabled only during sleep mode.
**/
void RCC_AHB_Peripheral_Clock_Disable(uint32_t AHB_periph)
{
    RCC->AHBPCLKEN &= ~AHB_periph;
}

/**
*\*\name    RCC_APB2_Peripheral_Clock_Enable.
*\*\fun     Enables the High Speed APB (APB2) peripheral clock.
*\*\param   APB2_periph (APB2 peripheral to gates its clock):
*\*\        - RCC_APB2_PERIPH_AFIO   
*\*\        - RCC_APB2_PERIPH_BEEPER 
*\*\        - RCC_APB2_PERIPH_TIM1   
*\*\        - RCC_APB2_PERIPH_SPI1   
*\*\        - RCC_APB2_PERIPH_TIM8   
*\*\        - RCC_APB2_PERIPH_USART1 
*\*\        - RCC_APB2_PERIPH_UART3  
*\*\        - RCC_APB2_PERIPH_UART4  
*\*\        - RCC_APB2_PERIPH_SPI2   
*\*\return none. 
**/
void RCC_APB2_Peripheral_Clock_Enable(uint32_t APB2_periph)
{
    RCC->APB2PCLKEN |= APB2_periph;
}

/**
*\*\name    RCC_APB2_Peripheral_Clock_Disable.
*\*\fun     Disables the High Speed APB (APB2) peripheral clock.
*\*\param   APB2_periph (APB2 peripheral to gates its clock)：
*\*\        - RCC_APB2_PERIPH_AFIO   
*\*\        - RCC_APB2_PERIPH_BEEPER 
*\*\        - RCC_APB2_PERIPH_TIM1   
*\*\        - RCC_APB2_PERIPH_SPI1   
*\*\        - RCC_APB2_PERIPH_TIM8   
*\*\        - RCC_APB2_PERIPH_USART1 
*\*\        - RCC_APB2_PERIPH_UART3  
*\*\        - RCC_APB2_PERIPH_UART4  
*\*\        - RCC_APB2_PERIPH_SPI2   
*\*\return none. 
**/
void RCC_APB2_Peripheral_Clock_Disable(uint32_t APB2_periph)
{
    RCC->APB2PCLKEN &= ~APB2_periph;
}

/**
*\*\name    RCC_APB1_Peripheral_Clock_Enable.
*\*\fun     Enables the High Speed APB (APB1) peripheral clock.
*\*\param   APB1_periph (APB1 peripheral to gates its clock):
*\*\        - RCC_APB1_PERIPH_TIM2       
*\*\        - RCC_APB1_PERIPH_TIM3       
*\*\        - RCC_APB1_PERIPH_TIM4       
*\*\        - RCC_APB1_PERIPH_TIM5       
*\*\        - RCC_APB1_PERIPH_TIM6       
*\*\        - RCC_APB1_PERIPH_COMP       
*\*\        - RCC_APB1_PERIPH_COMP_FILT  
*\*\        - RCC_APB1_PERIPH_WWDG       
*\*\        - RCC_APB1_PERIPH_USART2     
*\*\        - RCC_APB1_PERIPH_I2C1       
*\*\        - RCC_APB1_PERIPH_I2C2       
*\*\        - RCC_APB1_PERIPH_CAN        
*\*\        - RCC_APB1_PERIPH_PWR        
*\*\return none. 
**/
void RCC_APB1_Peripheral_Clock_Enable(uint32_t APB1_periph)
{
    RCC->APB1PCLKEN |= APB1_periph;
}

/**
*\*\name    RCC_APB1_Peripheral_Clock_Disable.
*\*\fun     Disables the High Speed APB (APB1) peripheral clock.
*\*\param   APB1_periph (APB1 peripheral to gates its clock)：
*\*\        - RCC_APB1_PERIPH_TIM2       
*\*\        - RCC_APB1_PERIPH_TIM3       
*\*\        - RCC_APB1_PERIPH_TIM4       
*\*\        - RCC_APB1_PERIPH_TIM5       
*\*\        - RCC_APB1_PERIPH_TIM6       
*\*\        - RCC_APB1_PERIPH_COMP       
*\*\        - RCC_APB1_PERIPH_COMP_FILT  
*\*\        - RCC_APB1_PERIPH_WWDG       
*\*\        - RCC_APB1_PERIPH_USART2     
*\*\        - RCC_APB1_PERIPH_I2C1       
*\*\        - RCC_APB1_PERIPH_I2C2       
*\*\        - RCC_APB1_PERIPH_CAN        
*\*\        - RCC_APB1_PERIPH_PWR  
*\*\return none. 
**/
void RCC_APB1_Peripheral_Clock_Disable(uint32_t APB1_periph)
{
    RCC->APB1PCLKEN &= ~APB1_periph;
}

/**
*\*\name    RCC_AHB_Peripheral_Reset.
*\*\fun     AHB peripheral reset.
*\*\param   AHB_periph specifies the AHB peripheral to reset.    
*\*\         - RCC_AHB_PERIPH_GPIOA   
*\*\         - RCC_AHB_PERIPH_GPIOB   
*\*\         - RCC_AHB_PERIPH_GPIOC   
*\*\         - RCC_AHB_PERIPH_GPIOD   
*\*\         - RCC_AHB_PERIPH_ADC  
*\*\return none.
**/
void RCC_AHB_Peripheral_Reset(uint32_t AHB_periph)
{
    RCC->AHBPRST |= AHB_periph;
    RCC->AHBPRST &= ~AHB_periph;
}

/**
*\*\name    RCC_APB2_Peripheral_Reset.
*\*\fun     High Speed APB (APB2) peripheral reset.
*\*\param   APB2_periph specifies the APB2 peripheral to reset.
*\*\        - RCC_APB2_PERIPH_AFIO   
*\*\        - RCC_APB2_PERIPH_BEEPER 
*\*\        - RCC_APB2_PERIPH_TIM1   
*\*\        - RCC_APB2_PERIPH_SPI1   
*\*\        - RCC_APB2_PERIPH_TIM8   
*\*\        - RCC_APB2_PERIPH_USART1 
*\*\        - RCC_APB2_PERIPH_UART3  
*\*\        - RCC_APB2_PERIPH_UART4  
*\*\        - RCC_APB2_PERIPH_SPI2 
*\*\return none.
**/
void RCC_APB2_Peripheral_Reset(uint32_t APB2_periph)
{
    RCC->APB2PRST |= APB2_periph;
    RCC->APB2PRST &= ~APB2_periph;
}

/**
*\*\name    RCC_APB1_Peripheral_Reset.
*\*\fun     Low Speed APB (APB1) peripheral reset.
*\*\param   APB1_periph specifies the APB1 peripheral to reset.
*\*\        - RCC_APB1_PERIPH_TIM2       
*\*\        - RCC_APB1_PERIPH_TIM3       
*\*\        - RCC_APB1_PERIPH_TIM4       
*\*\        - RCC_APB1_PERIPH_TIM5       
*\*\        - RCC_APB1_PERIPH_TIM6       
*\*\        - RCC_APB1_PERIPH_COMP               
*\*\        - RCC_APB1_PERIPH_WWDG       
*\*\        - RCC_APB1_PERIPH_USART2     
*\*\        - RCC_APB1_PERIPH_I2C1       
*\*\        - RCC_APB1_PERIPH_I2C2       
*\*\        - RCC_APB1_PERIPH_CAN        
*\*\        - RCC_APB1_PERIPH_PWR  
*\*\return none. 
**/
void RCC_APB1_Peripheral_Reset(uint32_t APB1_periph)
{
    RCC->APB1PRST |= APB1_periph;
    RCC->APB1PRST &= ~APB1_periph;
}

/**
*\*\name    RCC_Backup_Reset.
*\*\fun     Backup domain reset.
*\*\param   none  
*\*\return  none. 
**/
void RCC_Backup_Reset(void)
{
    *(__IO uint32_t*)RCC_BDSFTRST_BITBAND = (uint32_t)ENABLE;
    *(__IO uint32_t*)RCC_BDSFTRST_BITBAND = (uint32_t)DISABLE;
}

/**
*\*\name   RCC_MCO_PLL_Prescaler_Config.
*\*\fun    Configures the MCO PLL clock prescaler.
*\*\param  MCO_PLL_prescaler(MCO PLL clock prescaler): 
*\*\        - RCC_MCO_PLLCLK_DIV2 
*\*\        - RCC_MCO_PLLCLK_DIV3 
*\*\        - RCC_MCO_PLLCLK_DIV4 
*\*\        - RCC_MCO_PLLCLK_DIV5 
*\*\        - RCC_MCO_PLLCLK_DIV6 
*\*\        - RCC_MCO_PLLCLK_DIV7 
*\*\        - RCC_MCO_PLLCLK_DIV8 
*\*\        - RCC_MCO_PLLCLK_DIV9 
*\*\        - RCC_MCO_PLLCLK_DIV10
*\*\        - RCC_MCO_PLLCLK_DIV11
*\*\        - RCC_MCO_PLLCLK_DIV12
*\*\        - RCC_MCO_PLLCLK_DIV13
*\*\        - RCC_MCO_PLLCLK_DIV14
*\*\        - RCC_MCO_PLLCLK_DIV15 
*\*\return  none. 
**/
void RCC_MCO_PLL_Prescaler_Config(uint32_t MCO_PLL_prescaler)
{
    uint32_t temp_value = 0;

    temp_value = RCC->CFG;
    /* Clear MCOPRE[3:0] bits */
    temp_value &= RCC_MCO_PLLCLK_DIV_MASK;
    /* Set MCOPRE[3:0] bits according to MCO_PLL_prescaler value */
    temp_value |= MCO_PLL_prescaler;

